-- Заполнение справочника MPA (только если таблица пуста)
MERGE INTO mpa_rating (mpa_id, mpa_name, description)
KEY (mpa_id)
VALUES
(1, 'G', 'У фильма нет возрастных ограничений'),
(2, 'PG', 'Детям рекомендуется смотреть фильм с родителями'),
(3, 'PG-13', 'Детям до 13 лет просмотр не желателен'),
(4, 'R', 'Лицам до 17 лет просматривать фильм можно только в присутствии взрослого'),
(5, 'NC-17', 'Лицам до 18 лет просмотр запрещён');

-- Заполнение справочника жанров
MERGE INTO genre (genre_id, genre_name)
KEY (genre_id)
VALUES
(1, 'Комедия'),
(2, 'Драма'),
(3, 'Мультфильм'),
(4, 'Триллер'),
(5, 'Документальный'),
(6, 'Боевик');